Q1.Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [7]:
s=pd.Series([4,8,15,16,23,42])

In [8]:
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [9]:
type(s)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [10]:
l=[1,2,3,4,5,6,7,8,9,10]

In [11]:
s1=pd.Series(l)

In [12]:
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [14]:
data={
    "Name": ['Alice','Bob','Claire'],
    "Age": [25,30,27],
    "Gender":["Female","Male","Female"]
}

In [15]:
df=pd.DataFrame(data)

In [16]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4.What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional, labeled data structure with columns of potentially different types, similar to a spreadsheet or SQL table. It is a primary data structure in Pandas and is used for data manipulation, analysis, and cleaning.

On the other hand, a Series is a one-dimensional labeled array capable of holding any data type. It can be thought of as a column in a DataFrame, or as a simple, indexed array.

Q5 What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

1. head(): Returns the first n rows of the DataFrame. This function is useful to get a quick glimpse of the data.

2. tail(): Returns the last n rows of the DataFrame. This function is useful to check the end of the data.

3. describe(): Returns the statistical summary of the DataFrame, such as count, mean, standard deviation, minimum, and maximum values.

4. drop(): Drops rows or columns from the DataFrame. This function is useful to remove unnecessary data.

5. sort_values(): Sorts the DataFrame by one or more columns. This function is useful to order the data by a specific column.

6. groupby(): Groups the DataFrame by one or more columns. This function is useful to summarize data by category.

7. merge(): Merges two DataFrames based on one or more columns. This function is useful to combine data from different sources.

In [18]:
data={
    "Name": ['Alice','Bob','Claire'],
    "Age": [25,30,27],
    "Gender":["Female","Male","Female"]
}
df=pd.DataFrame(data)

In [28]:
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [29]:
df.tail()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [20]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [36]:
df.drop("Age",axis=1)

     Name  Gender
0   Alice  Female
1     Bob    Male
2  Claire  Female

In [41]:
df.sort_values("Age")

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In pandas, both Series and DataFrame are mutable in nature, which means they can be modified after creation.

Q7. Create a DataFrame using multiple Series. Explain with an example.

A DataFrame is a two-dimensional table-like data structure that contains rows and columns of data. A Series is a one-dimensional labeled array that can hold data of any type. We can create a DataFrame using multiple Series by combining them horizontally, meaning each Series will become a column in the DataFrame.

To create a DataFrame using multiple Series, we can use the pd.DataFrame() function from the pandas library. The syntax of this function is pd.DataFrame(data, index, columns) where data is a dictionary or a 2D array-like object containing the data for each column, index is the row labels, and columns are the column labels.

In [45]:
import pandas as pd

names = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
ages = pd.Series([25, 30, 35, 40])
genders = pd.Series(['female', 'male', 'male', 'male'])

df = pd.DataFrame({'Name': names, 'Age': ages, 'Gender': genders})

df

      Name  Age  Gender
0    Alice   25  female
1      Bob   30    male
2  Charlie   35    male
3    David   40    male